case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.5 0.53 -0.5)
    (4 0.53 -0.5)
    (4 2 -0.5)
    (-1.5 2 -0.5)
    (-1.5 0.53 1)
    (4 0.53 1)
    (4 2 1)
    (-1.5 2 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 20) simpleGrading (1 1 1)
);

boundary
(
    outer
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
