case_template/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  13
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// You can name this block whatever you like (e.g., "myGeometry", "Air", etc.)
Wing
{
    // Explicitly list the surface files to extract features from.
    // Ensure "yourGeometry.stl" is located in constant/triSurface/
    surfaces
    (
        "Optimized_Wing.stl"
    );

    // Identify a feature edge when the angle between adjacent faces is 
    // less than this value. 
    // - 180 : Selects all edges
    // - 0   : Selects no edges
    // - 150 : Standard default; captures most sharp corners (>30 degree bend)
    includedAngle       180;

    // Optional: Do not mark region edges based on surface topology, 
    // evaluate features based purely on the geometry (includedAngle).
    geometricTestOnly   yes;

    // Filter the extracted features
    subsetFeatures
    {
        // Keep non-manifold edges (edges connected to 3 or more faces)
        nonManifoldEdges       yes;

        // Keep open edges (edges connected to only 1 face - boundary edges)
        openEdges              yes;
    }

    // Write the extracted edges to an .obj file in the constant/extendedFeatureEdgeMesh/ 
    // directory. Highly recommended for visualizing extracted features in ParaView.
    writeObj            yes;
}

// ************************************************************************* //